# Seminar 2. Task 3
# Напишите программу, в которой пользователь будет задавать две строки,
# программа - определять количество вхождений одной строки в другой.

string_1 = input(
    'Определим количество вхождений одной строки в другую. Введите основную строку - ')
string_2 = input('Введите значения для поиска - ')
print(string_1.count(string_2))
